ARMmbed/mbed-os/hal/targets/cmsis/TARGET_Atmel/TARGET_SAM_CortexM4/utils/cmsis/TARGET_SAMG55/include/pio/pio_samg55n19.h
#define PIO_PB0B_TXD6        (1u << 0)  /**< \brief Twi6 signal: TXD6/SPI6_MOSI/TWD6 */
#define PIO_PB0B_SPI6_MOSI   (1u << 0)  /**< \brief Twi6 signal: TXD6/SPI6_MOSI/TWD6 */
#define PIO_PB0B_TWD6        (1u << 0)  /**< \brief Twi6 signal: TXD6/SPI6_MOSI/TWD6 */
#define PIO_PB10B_TXD6       (1u << 10) /**< \brief Twi6 signal: TXD6/SPI6_MOSI/TWD6 */
#define PIO_PB10B_SPI6_MOSI  (1u << 10) /**< \brief Twi6 signal: TXD6/SPI6_MOSI/TWD6 */
#define PIO_PB10B_TWD6       (1u << 10) /**< \brief Twi6 signal: TXD6/SPI6_MOSI/TWD6 */
/* ========== Pio definition for TWI7 peripheral ========== */
#define PIO_PA27B_RXD7       (1u << 27) /**< \brief Twi7 signal: RXD7/SPI7_MISO/TWCK7 */
#define PIO_PA27B_SPI7_MISO  (1u << 27) /**< \brief Twi7 signal: RXD7/SPI7_MISO/TWCK7 */
#define PIO_PA27B_TWCK7      (1u << 27) /**< \brief Twi7 signal: RXD7/SPI7_MISO/TWCK7 */
#define PIO_PA28B_TXD7       (1u << 28) /**< \brief Twi7 signal: TXD7/SPI7_MOSI/TWD7 */
#define PIO_PA28B_SPI7_MOSI  (1u << 28) /**< \brief Twi7 signal: TXD7/SPI7_MOSI/TWD7 */
#define PIO_PA28B_TWD7       (1u << 28) /**< \brief Twi7 signal: TXD7/SPI7_MOSI/TWD7 */
/* ========== Pio definition for USART0 peripheral ========== */
#define PIO_PA9A_RXD0        (1u << 9)  /**< \brief Usart0 signal: RXD0/SPI0_MISO/TWCK0 */
#define PIO_PA9A_SPI0_MISO   (1u << 9)  /**< \brief Usart0 signal: RXD0/SPI0_MISO/TWCK0 */
#define PIO_PA9A_TWCK0       (1u << 9)  /**< \brief Usart0 signal: RXD0/SPI0_MISO/TWCK0 */
#define PIO_PB0A_SCK0        (1u << 0)  /**< \brief Usart0 signal: SCK0/SPI0_SPCK */
#define PIO_PB0A_SPI0_SPCK   (1u << 0)  /**< \brief Usart0 signal: SCK0/SPI0_SPCK */
#define PIO_PA25A_SPI0_NPCS0 (1u << 25) /**< \brief Usart0 signal: SPI0_NPCS0/CTS0 */
#define PIO_PA25A_CTS0       (1u << 25) /**< \brief Usart0 signal: SPI0_NPCS0/CTS0 */
#define PIO_PA26A_SPI0_NPCS1 (1u << 26) /**< \brief Usart0 signal: SPI0_NPCS1/RTS0 */
#define PIO_PA26A_RTS0       (1u << 26) /**< \brief Usart0 signal: SPI0_NPCS1/RTS0 */
#define PIO_PA10A_TXD0       (1u << 10) /**< \brief Usart0 signal: TXD0/SPI0_MOSI/TWD0 */
#define PIO_PA10A_SPI0_MOSI  (1u << 10) /**< \brief Usart0 signal: TXD0/SPI0_MOSI/TWD0 */
#define PIO_PA10A_TWD0       (1u << 10) /**< \brief Usart0 signal: TXD0/SPI0_MOSI/TWD0 */
/* ========== Pio definition for USART1 peripheral ========== */
#define PIO_PB2A_RXD1        (1u << 2)  /**< \brief Usart1 signal: RXD1/SPI1_MISO/TWCK1 */
#define PIO_PB2A_SPI1_MISO   (1u << 2)  /**< \brief Usart1 signal: RXD1/SPI1_MISO/TWCK1 */
#define PIO_PB2A_TWCK1       (1u << 2)  /**< \brief Usart1 signal: RXD1/SPI1_MISO/TWCK1 */
#define PIO_PA27A_SCK1       (1u << 27) /**< \brief Usart1 signal: SCK1/SPI1_SPCK */
#define PIO_PA27A_SPI1_SPCK  (1u << 27) /**< \brief Usart1 signal: SCK1/SPI1_SPCK */
#define PIO_PA28A_SPI1_NPCS0 (1u << 28) /**< \brief Usart1 signal: SPI1_NPCS0/CTS1 */
#define PIO_PA28A_CTS1       (1u << 28) /**< \brief Usart1 signal: SPI1_NPCS0/CTS1 */
#define PIO_PA29A_SPI1_NPCS1 (1u << 29) /**< \brief Usart1 signal: SPI1_NPCS1/RTS1 */
#define PIO_PA29A_RTS1       (1u << 29) /**< \brief Usart1 signal: SPI1_NPCS1/RTS1 */
#define PIO_PB3A_TXD1        (1u << 3)  /**< \brief Usart1 signal: TXD1/SPI1_MOSI/TWD1 */
#define PIO_PB3A_SPI1_MOSI   (1u << 3)  /**< \brief Usart1 signal: TXD1/SPI1_MOSI/TWD1 */
#define PIO_PB3A_TWD1        (1u << 3)  /**< \brief Usart1 signal: TXD1/SPI1_MOSI/TWD1 */
/* ========== Pio definition for USART2 peripheral ========== */
#define PIO_PA5A_RXD2        (1u << 5)  /**< \brief Usart2 signal: RXD2/SPI2_MISO/TWCK2 */
#define PIO_PA5A_SPI2_MISO   (1u << 5)  /**< \brief Usart2 signal: RXD2/SPI2_MISO/TWCK2 */
#define PIO_PA5A_TWCK2       (1u << 5)  /**< \brief Usart2 signal: RXD2/SPI2_MISO/TWCK2 */
#define PIO_PA15B_SCK2       (1u << 15) /**< \brief Usart2 signal: SCK2/SPI2_SPCK */
#define PIO_PA15B_SPI2_SPCK  (1u << 15) /**< \brief Usart2 signal: SCK2/SPI2_SPCK */
#define PIO_PA24B_SCK2       (1u << 24) /**< \brief Usart2 signal: SCK2/SPI2_SPCK */
#define PIO_PA24B_SPI2_SPCK  (1u << 24) /**< \brief Usart2 signal: SCK2/SPI2_SPCK */
#define PIO_PA16A_SPI2_NPCS0 (1u << 16) /**< \brief Usart2 signal: SPI2_NPCS0/CTS2 */
#define PIO_PA16A_CTS2       (1u << 16) /**< \brief Usart2 signal: SPI2_NPCS0/CTS2 */
#define PIO_PA15A_SPI2_NPCS1 (1u << 15) /**< \brief Usart2 signal: SPI2_NPCS1/RTS2 */
#define PIO_PA15A_RTS2       (1u << 15) /**< \brief Usart2 signal: SPI2_NPCS1/RTS2 */
#define PIO_PA6A_TXD2        (1u << 6)  /**< \brief Usart2 signal: TXD2/SPI2_MOSI/TWD2 */
#define PIO_PA6A_SPI2_MOSI   (1u << 6)  /**< \brief Usart2 signal: TXD2/SPI2_MOSI/TWD2 */
#define PIO_PA6A_TWD2        (1u << 6)  /**< \brief Usart2 signal: TXD2/SPI2_MOSI/TWD2 */
/* ========== Pio definition for USART3 peripheral ========== */
#define PIO_PA4A_RXD3        (1u << 4)  /**< \brief Usart3 signal: RXD3/SPI3_MISO/TWCK3 */
#define PIO_PA4A_SPI3_MISO   (1u << 4)  /**< \brief Usart3 signal: RXD3/SPI3_MISO/TWCK3 */
#define PIO_PA4A_TWCK3       (1u << 4)  /**< \brief Usart3 signal: RXD3/SPI3_MISO/TWCK3 */
#define PIO_PB13A_SCK3       (1u << 13) /**< \brief Usart3 signal: SCK3/SPI3_SPCK */
#define PIO_PB13A_SPI3_SPCK  (1u << 13) /**< \brief Usart3 signal: SCK3/SPI3_SPCK */
#define PIO_PB14A_SPI3_NPCS0 (1u << 14) /**< \brief Usart3 signal: SPI3_NPCS0/CTS3 */
#define PIO_PB14A_CTS3       (1u << 14) /**< \brief Usart3 signal: SPI3_NPCS0/CTS3 */
#define PIO_PB15A_SPI3_NPCS1 (1u << 15) /**< \brief Usart3 signal: SPI3_NPCS1/RTS3 */
#define PIO_PB15A_RTS3       (1u << 15) /**< \brief Usart3 signal: SPI3_NPCS1/RTS3 */
#define PIO_PA3A_TXD3        (1u << 3)  /**< \brief Usart3 signal: TXD3/SPI3_MOSI/TWD3 */
#define PIO_PA3A_SPI3_MOSI   (1u << 3)  /**< \brief Usart3 signal: TXD3/SPI3_MOSI/TWD3 */
#define PIO_PA3A_TWD3        (1u << 3)  /**< \brief Usart3 signal: TXD3/SPI3_MOSI/TWD3 */
/* ========== Pio definition for USART4 peripheral ========== */
#define PIO_PB9A_RXD4        (1u << 9)  /**< \brief Usart4 signal: RXD4/SPI4_MISO/TWCK4 */
#define PIO_PB9A_SPI4_MISO   (1u << 9)  /**< \brief Usart4 signal: RXD4/SPI4_MISO/TWCK4 */
#define PIO_PB9A_TWCK4       (1u << 9)  /**< \brief Usart4 signal: RXD4/SPI4_MISO/TWCK4 */
#define PIO_PB11A_RXD4       (1u << 11) /**< \brief Usart4 signal: RXD4/SPI4_MISO/TWCK4 */
#define PIO_PB11A_SPI4_MISO  (1u << 11) /**< \brief Usart4 signal: RXD4/SPI4_MISO/TWCK4 */
#define PIO_PB11A_TWCK4      (1u << 11) /**< \brief Usart4 signal: RXD4/SPI4_MISO/TWCK4 */
#define PIO_PB1A_SCK4        (1u << 1)  /**< \brief Usart4 signal: SCK4/SPI4_SPCK */
#define PIO_PB1A_SPI4_SPCK   (1u << 1)  /**< \brief Usart4 signal: SCK4/SPI4_SPCK */
#define PIO_PB8B_SPI4_NPCS0  (1u << 8)  /**< \brief Usart4 signal: SPI4_NPCS0/CTS4 */
#define PIO_PB8B_CTS4        (1u << 8)  /**< \brief Usart4 signal: SPI4_NPCS0/CTS4 */
#define PIO_PB9B_SPI4_NPCS1  (1u << 9)  /**< \brief Usart4 signal: SPI4_NPCS1/RTS4 */
#define PIO_PB9B_RTS4        (1u << 9)  /**< \brief Usart4 signal: SPI4_NPCS1/RTS4 */
#define PIO_PB8A_TXD4        (1u << 8)  /**< \brief Usart4 signal: TXD4/SPI4_MOSI/TWD4 */
#define PIO_PB8A_SPI4_MOSI   (1u << 8)  /**< \brief Usart4 signal: TXD4/SPI4_MOSI/TWD4 */
#define PIO_PB8A_TWD4        (1u << 8)  /**< \brief Usart4 signal: TXD4/SPI4_MOSI/TWD4 */
#define PIO_PB10A_TXD4       (1u << 10) /**< \brief Usart4 signal: TXD4/SPI4_MOSI/TWD4 */
#define PIO_PB10A_SPI4_MOSI  (1u << 10) /**< \brief Usart4 signal: TXD4/SPI4_MOSI/TWD4 */
#define PIO_PB10A_TWD4       (1u << 10) /**< \brief Usart4 signal: TXD4/SPI4_MOSI/TWD4 */
/* ========== Pio definition for USART5 peripheral ========== */
#define PIO_PA12A_RXD5       (1u << 12) /**< \brief Usart5 signal: RXD5/SPI5_MISO/TWCK5 */
#define PIO_PA12A_SPI5_MISO  (1u << 12) /**< \brief Usart5 signal: RXD5/SPI5_MISO/TWCK5 */
#define PIO_PA12A_TWCK5      (1u << 12) /**< \brief Usart5 signal: RXD5/SPI5_MISO/TWCK5 */
#define PIO_PA14A_SCK5       (1u << 14) /**< \brief Usart5 signal: SCK5/SPI5_SPCK */
#define PIO_PA14A_SPI5_SPCK  (1u << 14) /**< \brief Usart5 signal: SCK5/SPI5_SPCK */
#define PIO_PA11A_SPI5_NPCS0 (1u << 11) /**< \brief Usart5 signal: SPI5_NPCS0/CTS5 */
#define PIO_PA11A_CTS5       (1u << 11) /**< \brief Usart5 signal: SPI5_NPCS0/CTS5 */
#define PIO_PA5B_SPI5_NPCS1  (1u << 5)  /**< \brief Usart5 signal: SPI5_NPCS1/RTS5 */
#define PIO_PA5B_RTS5        (1u << 5)  /**< \brief Usart5 signal: SPI5_NPCS1/RTS5 */
#define PIO_PB2B_SPI5_NPCS1  (1u << 2)  /**< \brief Usart5 signal: SPI5_NPCS1/RTS5 */
#define PIO_PB2B_RTS5        (1u << 2)  /**< \brief Usart5 signal: SPI5_NPCS1/RTS5 */
#define PIO_PA13A_TXD5       (1u << 13) /**< \brief Usart5 signal: TXD5/SPI5_MOSI/TWD5 */
#define PIO_PA13A_SPI5_MOSI  (1u << 13) /**< \brief Usart5 signal: TXD5/SPI5_MOSI/TWD5 */
#define PIO_PA13A_TWD5       (1u << 13) /**< \brief Usart5 signal: TXD5/SPI5_MOSI/TWD5 */
/* ========== Pio definition for USART6 peripheral ========== */
#define PIO_PB1B_RXD6        (1u << 1)  /**< \brief Usart6 signal: RXD6/SPI6_MISO/TWCK6 */
#define PIO_PB1B_SPI6_MISO   (1u << 1)  /**< \brief Usart6 signal: RXD6/SPI6_MISO/TWCK6 */
#define PIO_PB1B_TWCK6       (1u << 1)  /**< \brief Usart6 signal: RXD6/SPI6_MISO/TWCK6 */
#define PIO_PB11B_RXD6       (1u << 11) /**< \brief Usart6 signal: RXD6/SPI6_MISO/TWCK6 */
#define PIO_PB11B_SPI6_MISO  (1u << 11) /**< \brief Usart6 signal: RXD6/SPI6_MISO/TWCK6 */
#define PIO_PB11B_TWCK6      (1u << 11) /**< \brief Usart6 signal: RXD6/SPI6_MISO/TWCK6 */
#define PIO_PB13B_SCK6       (1u << 13) /**< \brief Usart6 signal: SCK6/SPI6_SPCK */
#define PIO_PB13B_SPI6_SPCK  (1u << 13) /**< \brief Usart6 signal: SCK6/SPI6_SPCK */
#define PIO_PB14B_SPI6_NPCS0 (1u << 14) /**< \brief Usart6 signal: SPI6_NPCS0/CTS6 */
#define PIO_PB14B_CTS6       (1u << 14) /**< \brief Usart6 signal: SPI6_NPCS0/CTS6 */
#define PIO_PB15B_SPI6_NPCS1 (1u << 15) /**< \brief Usart6 signal: SPI6_NPCS1/RTS6 */
#define PIO_PB15B_RTS6       (1u << 15) /**< \brief Usart6 signal: SPI6_NPCS1/RTS6 */
#define PIO_PB0B_TXD6        (1u << 0)  /**< \brief Usart6 signal: TXD6/SPI6_MOSI/TWD6 */
#define PIO_PB0B_SPI6_MOSI   (1u << 0)  /**< \brief Usart6 signal: TXD6/SPI6_MOSI/TWD6 */
#define PIO_PB0B_TWD6        (1u << 0)  /**< \brief Usart6 signal: TXD6/SPI6_MOSI/TWD6 */
#define PIO_PB10B_TXD6       (1u << 10) /**< \brief Usart6 signal: TXD6/SPI6_MOSI/TWD6 */
#define PIO_PB10B_SPI6_MOSI  (1u << 10) /**< \brief Usart6 signal: TXD6/SPI6_MOSI/TWD6 */
#define PIO_PB10B_TWD6       (1u << 10) /**< \brief Usart6 signal: TXD6/SPI6_MOSI/TWD6 */
/* ========== Pio definition for USART7 peripheral ========== */
#define PIO_PA27B_RXD7       (1u << 27) /**< \brief Usart7 signal: RXD7/SPI7_MISO/TWCK7 */
#define PIO_PA27B_SPI7_MISO  (1u << 27) /**< \brief Usart7 signal: RXD7/SPI7_MISO/TWCK7 */
#define PIO_PA27B_TWCK7      (1u << 27) /**< \brief Usart7 signal: RXD7/SPI7_MISO/TWCK7 */
#define PIO_PA29B_SCK7       (1u << 29) /**< \brief Usart7 signal: SCK7/SPI7_SPCK */
#define PIO_PA29B_SPI7_SPCK  (1u << 29) /**< \brief Usart7 signal: SCK7/SPI7_SPCK */
#define PIO_PA30B_SPI7_NPCS0 (1u << 30) /**< \brief Usart7 signal: SPI7_NPCS0/CTS7 */
#define PIO_PA30B_CTS7       (1u << 30) /**< \brief Usart7 signal: SPI7_NPCS0/CTS7 */
#define PIO_PA31B_SPI7_NPCS1 (1u << 31) /**< \brief Usart7 signal: SPI7_NPCS1/RTS7 */
#define PIO_PA31B_RTS7       (1u << 31) /**< \brief Usart7 signal: SPI7_NPCS1/RTS7 */
#define PIO_PA28B_TXD7       (1u << 28) /**< \brief Usart7 signal: TXD7/SPI7_MOSI/TWD7 */
#define PIO_PA28B_SPI7_MOSI  (1u << 28) /**< \brief Usart7 signal: TXD7/SPI7_MOSI/TWD7 */
#define PIO_PA28B_TWD7       (1u << 28) /**< \brief Usart7 signal: TXD7/SPI7_MOSI/TWD7 */
/* ========== Pio indexes ========== */
#define PIO_PA0_IDX          0
#define PIO_PA1_IDX          1
#define PIO_PA2_IDX          2
#define PIO_PA3_IDX          3
#define PIO_PA4_IDX          4
#define PIO_PA5_IDX          5
#define PIO_PA6_IDX          6
#define PIO_PA7_IDX          7
#define PIO_PA8_IDX          8
#define PIO_PA9_IDX          9
#define PIO_PA10_IDX         10
#define PIO_PA11_IDX         11
#define PIO_PA12_IDX         12
#define PIO_PA13_IDX         13
#define PIO_PA14_IDX         14
#define PIO_PA15_IDX         15
#define PIO_PA16_IDX         16
#define PIO_PA17_IDX         17
#define PIO_PA18_IDX         18
#define PIO_PA19_IDX         19
#define PIO_PA20_IDX         20
#define PIO_PA21_IDX         21
#define PIO_PA22_IDX         22
#define PIO_PA23_IDX         23
#define PIO_PA24_IDX         24
#define PIO_PA25_IDX         25
#define PIO_PA26_IDX         26
#define PIO_PA27_IDX         27
#define PIO_PA28_IDX         28
#define PIO_PA29_IDX         29
#define PIO_PA30_IDX         30
#define PIO_PA31_IDX         31
#define PIO_PB0_IDX          32
#define PIO_PB1_IDX          33
#define PIO_PB2_IDX          34
#define PIO_PB3_IDX          35
#define PIO_PB4_IDX          36
#define PIO_PB5_IDX          37
#define PIO_PB6_IDX          38
#define PIO_PB7_IDX          39
#define PIO_PB8_IDX          40
#define PIO_PB9_IDX          41
#define PIO_PB10_IDX         42
#define PIO_PB11_IDX         43
#define PIO_PB12_IDX         44
#define PIO_PB13_IDX         45
#define PIO_PB14_IDX         46
#define PIO_PB15_IDX         47

#endif /* _SAMG55N19_PIO_ */
